/*
Задача 19. За да стане голям един заек му е необходим един месец. След още един месец се ражда
още един заeк и така зайците стават 2. След още един месец първият заeк ражда още едно ново
зайче, а вторият е пораснал и така зайците са станали 3. След още един месец първите два заека
раждат по още един нов заек, а третият порасва и така нататък.
По този начин се получава известната редица на Фибоначи от числата 1, 1, 2, 3, 5, 8, 13, . . .
Характерното за тази редица е, че всяко следващо число от нея се получава като се сумират
предходните две числа. Да се напише програма, която чете едно цяло положително число n и
извежда n-тото число от тази редица
*/

// define variables for the last two, and the current number in the sequence
// iterate until the provided index (using for)
//  ( you don't need to start at 0, because the first two numbers are 1 )
//      the old 'last' number becomes 'second-last',
//      the old 'current' number becomes 'last',
//      add the previous numbers to 'current'
